[
  {
    "id": 1,
    "slug": "ubuntu-application-switcher",
    "title": "Ubuntu Application Switcher",
    "categories": ["UX Design", "Prototyping", "UI Development", "Tooling"],
    "description": "Canonical Ltd. started developing Ubuntu for mobile devices. As part of this effort, I designed and prototyped an application switcher for Ubuntu Touch OS.",
    "thumbnail": "/project-1/composition.webp",
    "show": true,
    "featured": true,
    "featured_image": "/project-1/composition.webp",
    "year": "2015",
    "role": "Lead Interaction Designer",
    "client": "Canonical Ltd.",
    "content":[
      {
        "type": "TextSection",
        "title": "The UX Challenge",
        "text": "Application switching is one of the most often performed tasks in both mobile and desktop operating systems. Hence it needs to be a fluid and frictionless interaction. For this project the main requirements were: \n\n• Full convergence: the same switcher would need to work on phone, tablet and PC desktop. \n• Needs to handle both windowed and non-windowed environments. \n• Multiple workspace support needs to be taken into account. \n• Needs to support all available input types: touch, pointer and keyboard. \n• Single code base approach (stakeholder and engineering requirement). \n• The existing design relying on stacked cards needs to be taken into consideration. \n\n The main UX challenges:\n • How to create an adapting layout that transforms andcovers all use cases.\n • Creating consistent set of transitions and animations which would also be delightful to use and reinforce user’s metal model of the system.\n • Application window size can be arbitrary and vary between the windows simultaneously on the screen.\n • Horizontal space is limited but the design needs to scale to support 0-N application and 0-N workspaces."
      },
      {
        "type": "TextSection",
        "title": "The UX Approach",
        "text": "Guiding design principles that helped in the design process:\n\n • Prefer subtle and unobtrusive animations to provide quick and consistent feeling across the use cases.\n• Utilise the screen real estate as well as possible and avoid overflow behind the screen edges.\n• Provide easily identifiable application info (card + icon + label).\n• Aim for full convergence: Same visual appearance, functionality and interactions across form factors, devices and input types.\n• Re-use existing Ubuntu design and visual patterns.\n\nI wrote an interactive prototype to help in design.This turned out\nto be invaluable approach that helped out to identify and solve many corner use cases. The prototype also worked as partial documentation for developers."
      },
     {
        "type": "ImageGallery",
        "images": [
          {
            "src": "/project-1/switcher-sketch-1.webp",
            "alt": "Design mockup 1 showing the line staging feature in action.",
            "caption": "Design mockup 1 showing the line staging feature in action."
          },
          {
            "src": "/project-1/switcher-sketch-2.webp",
            "alt": "Design mockup 2 showing the line staging feature in action.",
            "caption": "Design mockup 2 showing the line staging feature in action."
          },
          {
            "src": "/project-1/switcher-sketch-3.webp",
            "alt": "Design mockup 3 showing the line staging feature in action.",
            "caption": ""            
          },
          {
            "src": "/project-1/switcher-sketch-4.webp",
            "alt": "Design mockup 4 showing the line staging feature in action.",
            "caption": ""            
          },
          {
            "src": "/project-1/diagram.webp",
            "alt": "Design mockup 4 showing the line staging feature in action.",
            "caption": ""            
          }
        ]
      },
      {
        "type": "EmbeddedVideo",
        "url": "https://vimeo.com/1140845194",
        "caption": "I developed and heavily used this interactive prototype during the design process to validate and refine the user experience and find parameters for layout,animations and transitions."
      },
      {
        "type": "ImageSection",
        "title": "The final design",
        "image": "/project-1/convergence.webp",
        "alt": "An example image from the project.",
        "caption": "The same design and codebase works across phone, tablet and desktop form factors.",
        "align": "right",
        "text": "The result layout is fully responsive that automatically adjusts its element sizes, margins and visibility while maintaining balanced look and feel. Application windows are cropped in to a square shape with suitable cropping algorithm and application icon and label were added to maximise application identifiability. The final design supports following functionality: \n\n • Application switching. \n• Closing applications \n• Moving applications between workspaces \n• Closing, reordering and merging workspaces \n• Focusing on to another workspace. "
      },
      
      {
        "type": "TextSection",
        "title": "Impact",
        "text": "The converged switcher was part of Ubuntu 10.16 release as a default Unity 8 application switcher. \nThe final implementation is essential part of a product that got awarded: 🏆 **Orange Award for Converged Computing** at Mobile World Congress 2017."
      }
    ]
  },
  {
    "id": 2,
    "slug": "accessible-change-indicators",
    "title": "Accessible Version Control Change Indicators",
    "categories": ["UX Design", "Accessibility"],
    "description": "Designing accessible change indicators for Visual Studio to enhance code management for developers with disabilities.",
    "thumbnail": "/project-2/thumb.webp",
    "show": true,
    "featured": false,
    "featured_image": "/project-2/featured.webp",
    "year": 2021  ,
    "role": "Senior UX Designer",
    "client": "Microsoft",
    "content":[
      {
        "type": "TextSection",
        "title": "Project Overview",
        "text": "The code change indicators mark lines that have been modified, added, or deleted in the code file. The existing indicators in Visual Studio's version control system were not accessible for all users, and didn't provide the change type information being inconsistent with for example VS Code. I led the redesign work to ensure they were accessible and usable by all developers, regardless of their visual abilities."      
      },
      {
        "type": "ImageSection",
        "title": "UX Problem",
        "image": "/project-2/problem.webp",
        "alt": "@todo: change this alt text",
        "caption": "Emulation of how color blind users see the existing change indicators.",
        "align": "below",
        "text": "• The indicators had 2 visual states **changed-not saved (yellow bar)**, and **changed-saved (green bar)** represented only by color.\n• Different kinds of changes (addition, deletion, modification) don't have unique indicators.\n• Imparity with Visual Studio Code.\n•  Not accessible for vision impaired users.\n• Color contrast ratio is not sufficient for passing WCAG standards.\n• Some vision impaired users can’t distinguish unsaved changes from saved changes.\n• The change margin indicators don’t follow the Git status."
      },
      {
        "type": "TextSection",
        "title": "Objectives",
        "text": "• Align implementation with other Microsoft products.\n• Follow more industry standard style for code change indicators.\n• Make sure that the new implementation is fully accessible and passes the WCAG rules and Microsoft Accessibility Standards.\n• New design needs to support Line Staging feature the was being designed in parallel.\n• Design for both light and dark themes."
      },
      {
        "type": "TextSection",
        "title": "Design Process",
        "text": "First we conducted user research and usability testing with developers with visual impairments to understand their needs and challenges with the existing indicators. Collaborated with accessibility experts to ensure compliance with accessibility standards and guidelines. I explored various design options, including patterns, shapes, and textures, to create indicators that were easily distinguishable by all users. I developed prototypes and shared those in the community feedback tickets and user testing. I refined the designs based on the feedback from users and experts."      
      },
      {
        "type": "TextSection",
        "title": "Design Iterations",
        "text": "We went throught multiple design iterations to explore different visual representations. I tested various shapes, patterns, and color combinations to ensure that the indicators were easily distinguishable by all users. I also considered the overall aesthetics and how the new indicators would fit within the existing Visual Studio interface."
      },
      {
        "type": "ImageGallery",
        "images": [
          {
            "src": "/project-2/iterationX-textures.webp",
            "alt": "Change indicator design iteration exploring various texture patterns to represent different change types.",
            "caption": "I explored varions texture patterns to represent different change types."
          },
          {
            "src": "/project-2/iterationX-signs.webp",
            "alt": "Change indicator design iteration exploring various sign and character patterns to represent different change types.",
            "caption": "Also explored various sign and character patterns."
          },
          {
            "src": "/project-2/iteration3.webp",
            "alt": "Different design concepts in iteration 3",
            "caption": "In iteration 3, users clearly preferred design concept C3.2 over the other presented options."            
          },
          {
            "src": "/project-2/iteration4-staging-information.webp",
            "alt": "Design iteration 4 was too complex.",
            "caption": "Iteration 4 was one of the most complex designs as it showed both change type and staging information. This was concluded too much information for users to process at once."            
          }
        ]
      },
      {
        "type": "TextSection",
        "title": "Final Design and Impact",
        "text": "The final design was successfully implemented in Visual Studio 2022 version 17.3 and later. The design met the all the set objectives and received positive feedback from users, particularly those with visual impairments. \n\n I received a patent award for the design work. \n\nSome users still preferred the old design due to familiarity, and we provided an option to switch back to the previous design if desired. Even then, the yellow and green color values were updated for better contrast and accessibility."
      },
      {
        "type": "ImageGallery",
        "images": [
          {
            "src": "/project-2/final-1.webp",
            "alt": "alt text",
            "caption": "All different change types in light and dark themes."
          },
          {
            "src": "/project-2/final-2.webp",
            "alt": "alt text",
            "caption": "State diagram. "
          },
          {
            "src": "/project-2/final-3.webp",
            "alt": "alt text",
            "caption": "Accessible color hex values ready to be tokenized. "
          }
        ]
      },
      {
      "type": "TextSection",
      "title": "Links",
      "text": "Blog post about the line staging features by my PM partner: https://devblogs.microsoft.com/visualstudio/line-staging-interactive-staging/"
      }
    ] 
  },
  {
    "id": 3,
    "slug": "visual-studio-copilot-extenders",
    "title": "Visual Studio Copilot Integrations",
    "categories": ["UX Design", "AI", "Prototyping"],
    "description": "Designing Copilot AI integrations across developer tools",
    "thumbnail": "/project-3/Featured-VS-Copilot.webp",
    "show": true,
    "featured": false,
    "featured_image": "/project-3/Featured-VS-Copilot.webp",
    "year": 2025,
    "role": "Principal Designer",
    "client": "Microsoft Corporation",
    "content":[
      {
        "type": "TextSection",
        "title": "Project Overview",
        "text": "I owned and drove the GitHub Copilot integrations across toolsets throughout Visual Studio. I designed for optimised end-to-end experiences that boost developer productivity while navigating competing constraints across different feature teams, and aligning numerous stakeholders."
      },
      {
        "type": "TextSection",
        "title": "UX Challenge",
        "text": "Key challenges included:\n\n• The most product teams worked in silos and lacked of understanding the high-value end-to-end scenarios.\n• Fragmented experiences and inconsistent UI elements and language confused users and hindered productivity.\n• Introducing new powerful AI functionality on high-density UI can be challenging so that it's discoverable and understandable but doesn't mess with user's muscle memory. \n\n I collaborated closely with product managers, engineers, and other Copilot designers to identify pain points find opportunities for improvement and break silos between different teams."
      },
      {
        "type": "ImageSection",
        "title": "Example: Editor - Rename Suggestions",
        "text": "• Provide AI suggestions automatically without blocking the underlying UI.\n• Allow users to opt out and turn off the suggestions permanently. \n• Prevent unnecessary AI costs by cancelling LLM (Large Language Model) call if the user starts typing.\n• Provide intuitive keyboard navigation for power users.\n• Maintain consistency with other Copilot integrations in Visual Studio.",
        "image": "/project-3/editor-rename-suggestions.gif",
        "alt": "Image showing Editor - Rename Suggestions in responsive layout.  ",
        "caption": "Rename Suggestions prototype for engineering handoff.",
        "align": "right"
      },
      {
        "type": "ImageSection",
        "title": "Example: Diagnostics - Visualizer",
        "text": "With the updated UI user can write a natural language query and get relevant diagnostics data visualized directly in the code editor. This helps developers quickly understand and address issues in their code without needing to learn complex query languages or navigate through multiple tools.",
        "image": "/project-3/diagnostics-visualizer.gif",
        "alt": "Alt text  ",
        "caption": "User can toggle on the AI prompt and refine the current expression with natural language instructions.",
        "align": "below"
      },
      {
        "type": "TextSection",
        "title": "",
        "text": "Prototypes like this are at the core of my design process. They help to validate the designs early with users and stakeholders, and also serve as a clear communication tool for engineering handoff. This one was made directly in the Figma design tool using interactive components and animation features."
      },
      {
        "type": "ImageSection",
        "title": "UX Guidelines",
        "text": "Copilot partner teams worked in silos which had resulted fragmented and inconsistent UXexperiences. I created UX guidelines: \n\n• Established a unified design language for Copilot integrations across Visual Studio.\n• Empowered teams to make informed design decisions without designer involvement.\n• Strengthened cross-team collaboration and end-to-end user experience.",
        "image": "/project-3/ux-guidelines.webp",
        "alt": "An image of the table of contents for the Copilot UX Guidelines document.",
        "caption": "Table of contents for the Copilot Partner UX Guidelines.",
        "align": "right"
      },
      {
        "type": "TextSection",
        "title": "More designs...",
        "text": "As being responsible for all Copilot integrations in Visual Studio, I created many more designs for different teams. Here are a few more examples:"
      },
      {
        "type": "ImageGallery",
        "images": [
          {
            "src": "/project-3/copilot-pr-description.webp",
            "alt": "Design mockup showing the flow of using Copilot PR Description.",
            "caption": "Version Control - Copilot PR Description flow."
          },
          {
            "src": "/project-3/local-ai-review.webp",
            "alt": "Design mockup 2 showing the new indicator interactions.",
            "caption": "Version Control - Main UI elements of Local AI Review flow."
          },
          {
            "src": "/project-3/content-exclusion.webp",
            "alt": "Design file screenshot showing high-level view to content exclusion guidelines.",
            "caption": "Content exclusion was larger cross-team AI design task where I managed to establish clear UX guidelines and communicate those across multiple teams."
          },
          {
            "src": "/project-3/doc-comments.gif",
            "alt": "GIF of the doc comments Ambient AI prototype in action.",
            "caption": "Ambient AI - Doc Comments feature provides documentation on the fly based on the function code context."
          },
          {
            "src": "/project-3/generate-method.webp",
            "alt": "Generate method Ambient AI feature visualised in Visual Studio.",
            "caption": "Ambient AI - Generate Method feature helps developers quickly create new methods based on the existing code context."
          },
          {
            "src": "/project-3/performance-profiler.webp",
            "alt": "Diagnostics Performance profiler feature design mockup.",
            "caption": " A new diagnostics performance profiler launch page that provides AI recommended tools and allows natural language queries for finding relevant performance issues."
          }
        ]
      }
    ] 
  },
  {
    "id": 4,
    "slug": "visual-studio-new-git-experience",
    "title": "Visual Studio Version Control UX Redesign",
    "categories": ["UX Design", "User Research", "Prototyping"],
    "description": "Designing a new Git version control UX for Visual Studio to enhance developer productivity and collaboration.",
    "thumbnail": "/project-4/thumb.webp",
    "show": true,
    "featured": false,
    "featured_image": "/project-4/featured.webp",
    "year": 2020,
    "role": "Senior Designer",
    "client": "Microsoft Corporation",
    "content":[
      {
        "type": "TextSection",
        "title": "Project Overview",
        "text": "Git is the most used version control system in the world. Developers use it to manage their code changes and collaborate with other developers. Visual Studio IDE had an existing Git experience that was outdated and not user-friendly. I led the redesign effort to create make it more intuitive, efficient, and accessible for all developers."
      },
      
      {
        "type": "ImageSection",
        "title": "UX Problem",
        "image": "/tobeadded.webp",
        "alt": "Version control interface with multiple issues highlighted.",
        "caption": "Multiple problems identified in the existing version control interface.",
        "align": "right",
        "text": "The version control interface in Visual Studio had several usability issues that hindered developers' productivity. Key problems included unclear status indicators, a cluttered layout, and inefficient workflows for staging and committing changes."
      },
      {
        "type": "TextSection",
        "title": "UX Process",
        "text": "• I created design principles to guide the redesign process and to frame the decision making process with stakeholders.\n •"
      },
      {
        "type": "ImageSection",
        "title": "Research Findings",
        "image": "/tobeadded.webp",
        "alt": "Affinity diagram showing user research insights.",
        "caption": "Affinity diagram showing user research insights.",
        "align": "left",
        "text": "Together with program managers and researchers, we conducted user interviews and usability tests to gather insights into developers' pain points with the existing version control system. Key findings highlighted the need for clearer visual cues, simplified workflows, and better integration with other development tools."
      },
      {
        "type": "ImageSection",
        "title": "Git Graph Tags",
        "image": "/project-4/graph-tags.gif",
        "alt": "Image showing Git Graph Tags in responsive layout.  ",
        "caption": "Tags are responsive and adjusting to the column width.",
        "align": "below",
        "text": "Add text about Git Graph Tags here. The description needs to be long enough to show how the image aligns to the right of the text content."
      },
      {
        "type": "TextSection",
        "title": "Web appearance",
        "text": "The New Git Experience (Youtube): https://www.youtube.com/watch?v=ZiQ2LXtAJ6I"
      }
    ]
  },
  {
    "id": 5,
    "slug": "ubuntu-indicators",
    "title": "Ubuntu Touch Indicators", 
    "categories": ["Prototyping", "UX Design", "Tooling", "UI Development"],
    "description": "Gesture based indicator panel interactions for Ubuntu Touch OS.", 
    "thumbnail": "/project-5/thumb.webp",
    "show": true,
    "featured": false,
    "featured_image": "/project-5/featured.webp",
    "year": 2014,
    "role": "UX Prototyper",
    "client": "Canonical Ltd.",
    "content":[
      {
        "type": "TextSection",
        "title": "The UX Challenge",
        "text": "User testing had showed that the existing Ubuntu Touch indicators were suffering from several usability issues. My task was to re-design indicators and to fix following problems:\n\n•  Users didn’t understand the connections between different UI elements.\n• Users struggled with the swipe down gesture and didn’t get the targeted menu open.\n• Users struggled navigating between open menus.\n• The current design didn’t handle overflow situation when there are more indicators than available space."
      },
      {
        "type": "TextSection",
        "title": "The UX Approach",
        "text": "To handle the overflow **non-relevant indicators are hidden** in closed state. As soon as the opening gesture is started they become visible again and their menus are accessible. \n\nIndicator items expand once the gesture is started. Initial touch position provides **a horizontal anchor point** around which all expansions happen. This **ensures that the target item doesn’t move during the gesture**.\n\n**Vertical expansion** provides space for the label. Expanded item acts as a clear navigation element when indicators are open. Now two unconnected elements from the previous design were combined to one meaningful element.\n\n**Horizontal expansion provides space for more robust gesture** which was further enhanced with vertical velocity buffering and maximum vertical velocity threshold."
      },
      {
        "type": "ImageGallery",
        "images": [
          {
            "src": "/project-5/sketch.webp",
            "alt": "Design mockup 1 showing the new indicator interactions.",
            "caption": "Design mockup 1 showing the new indicator interactions."
          },
          {
            "src": "/project-5/variations.webp",
            "alt": "Collection of design mockups showing multiple layout and visual variations.",
            "caption": "Multiple layout and visual variations were explored to find the optimal solution."
          },
          {
            "src": "/project-5/spec.webp",
            "alt": "Design mockup 3 showing the new indicator interactions.",
            "caption": "Design mockup 3 showing the new indicator interactions."
          }
        ]
      },
      {
        "type": "EmbeddedVideo",
        "url": "https://vimeo.com/1146523128?fl=tl&fe=ec",
        "caption": "Functional prototype demonstrating the new indicator interactions."
      },
      {
        "type": "TextSection",
        "title": "The UX Impact",
        "text": "The new design retained all the good functionality from the old indicators while fixing all usability issues. The new indicator design was user tested multiple times and the results have been significantly better. It fullfilled the stakeholder expectations and also got great feedback from the actual Ubuntu phone users."
      }
    ]
  },
  {
    "id": 6,
    "slug": "screenreader-plugin-for-figma",
    "title": "Figma Screen Reader Plugin", 
    "categories": ["Tooling", "Accessibility", "UI Development"],
    "description": "Figma plugin to increase design workshop accessibility and productivity.", 
    "thumbnail": "/project-6/thumb.webp",
    "show": true,
    "featured": true,
    "featured_image": "/project-6/featured.webp",
    "year": 2023,
    "role": "Principal Designer",
    "client": "Microsoft Corporation",
    "content":[
      {
        "type": "TextSection",
        "title": "The Challenge",
        "text": "I attended a workshop focused on identifying problems with programming tools and improving the user experience from the perspective of screen reader users. I interviewed users and tried to communicate the tools I had created to them. I noticed the difficulty in communication because the designs were visual presentations, while visually impaired users rely on a screen reader as their sole interface daily. Validating the designs and obtaining concrete feedback was challenging."
      },
      {
        "type": "TextSection",
        "title": "The Solution",
        "text": "I wanted to design a better process and tool for accessible communication of designs to all workshop participants. I developed a plugin for the Figma design software I was using, which acted as a connecting tissue between the design tool and the operating system’s (macOS or Windows) screen reader (Narrator, VoiceOver, NVDA, JAWS, etc). The tool allowed designer to specify screenreader anouncements (ARIA live regions) that were spoken aloud while the design was being interacted with."
      },
      {
        "type": "ImageGallery",
        "images": [
          {
            "src": "/project-6/instructions-create.webp",
            "alt": "Documentation screenshot showing how to create screen reader annotations in Figma.",
            "caption": "Create: Documentation on how to create screen reader annotations in Figma."
          },
          {
            "src": "/project-6/instructions-play.webp",
            "alt": "Documentation screenshot showing how to play screen reader annotations in Figma.",
            "caption": "Play: Documentation on how to play screen reader annotations in Figma."
          }
        ]
      },
      {
        "type": "TextSection",
        "title": "The Impact",
        "text": "The tool enabled more effective communication with visually impaired users, allowing us to receive concrete feedback on our solutions. This process strengthened empathy and collaboration with screen reader users and provided valuable insights into their specific needs. Personally, I gained extensive experience with screen readers, accessibility best practices, Copilot AI-assisted coding, Figma plugins, and the Vue front-end framework, which was new to me."
      }
    ]
  } 
]
